# SQL 的五十道練習：初學者友善的資料庫八週專班

> 第二天

[數聚點](https://www.datainpoint.com/) | 郭耀仁 <yaojenkuo@datainpoint.com>

In [1]:
%LOAD sqlite3 db=../databases/imdb.db timeout=2 shared_cache=true

In [2]:
ATTACH "../databases/covid19.db" AS covid19;

## 運算符

## 運算符

1. 數值運算符：應用在資料類別為整數或浮點數的常數或欄位，運算結果為數值。
2. 文字運算符：應用在資料類別為文字的常數或欄位，運算結果為文字。
3. 關係運算符：應用會得到條件判斷結果 0（布林值 `False`）或 1（布林值 `True`）兩者其中之一。
4. 邏輯運算符：應用在資料類別屬於 0（布林值 `False`）或 1（布林值 `True`）的敘述、常數或欄位，運算結果為布林值。

## 數值運算符

針對整數（`integer`）與帶小數點的浮點數（`real`）的常數或欄位可以使用數值運算符衍生計算欄位，運算結果為數值，基礎的數值運算符有：

|數值運算符|作用描述|
|:-------|:------|
|`+`|相加|
|`-`|相減|
|`*`|相乘|
|`/`|相除|
|`%`|回傳餘數|
|`()`|優先運算|

In [3]:
SELECT runtime,
       runtime / 60 AS hours,
       runtime % 60 AS minutes
  FROM movies
 LIMIT 5;

+---------+-------+---------+
| runtime | hours | minutes |
+---------+-------+---------+
| 142     | 2     | 22      |
+---------+-------+---------+
| 175     | 2     | 55      |
+---------+-------+---------+
| 202     | 3     | 22      |
+---------+-------+---------+
| 152     | 2     | 32      |
+---------+-------+---------+
| 96      | 1     | 36      |
+---------+-------+---------+
5 rows in set (0.00 sec)

## 文字運算符

針對文字（`text`）的常數或欄位可以使用文字運算符衍生計算欄位，運算結果為文字，相較於數值運算符，文字運算符的數量少了許多，僅有 `||` 兩個垂直線（可透過 `Shift + \` 按出來）能夠**連接文字**。

In [4]:
SELECT runtime,
       (runtime / 60) || ' hours ' || (runtime % 60) || ' minutes' AS hours_minutes
  FROM movies
 LIMIT 5;

+---------+--------------------+
| runtime | hours_minutes      |
+---------+--------------------+
| 142     | 2 hours 22 minutes |
+---------+--------------------+
| 175     | 2 hours 55 minutes |
+---------+--------------------+
| 202     | 3 hours 22 minutes |
+---------+--------------------+
| 152     | 2 hours 32 minutes |
+---------+--------------------+
| 96      | 1 hours 36 minutes |
+---------+--------------------+
5 rows in set (0.00 sec)

## 關係運算符

|關係運算符|作用描述|
|:-------|:------|
|`=`|相等|
|`!=`|不相等|
|`>`|大於|
|`>=`|大於等於|
|`<`|小於|
|`<=`|小於等於|
|`LIKE`|相似|
|`IN`|存在於|
|`BETWEEN lower_bound AND upper_bound`|大於等於 `lower_bound` 且小於等於 `upper_bound`|
|`IS NULL`|是否為空值|

## 邏輯運算符

|邏輯運算符|作用描述|
|:-------|:------|
|`AND`|和，交集|
|`OR`|或，聯集|
|`NOT`|反轉布林值，將 0（布林值 `False`）與 1（布林值 `True`）互換|

## 函數

## 函數粗略分為兩大類

1. 通用函數（Universal functions）。
2. 聚合函數（Aggregate functions）。

## 通用函數與聚合函數

函數的作用方向不同，跟資料表是由列（水平方向）與欄（垂直方向）所組成的二維表格概念契合，通用函數作用在「水平方向」、聚合函數作用在「垂直方向」。

## 通用函數的特徵

每列觀測值對應一個輸出結果。

In [5]:
SELECT rating,
       ROUND(rating) AS round_rating
  FROM movies
 LIMIT 5;

+--------+--------------+
| rating | round_rating |
+--------+--------------+
| 9.3    | 9.0          |
+--------+--------------+
| 9.2    | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
| 9      | 9.0          |
+--------+--------------+
5 rows in set (0.00 sec)

## 聚合函數的特徵

一欄變數、`m` 列觀測值對應一個輸出結果。

In [6]:
SELECT AVG(rating) AS avg_rating
  FROM movies;

+------------------+
| avg_rating       |
+------------------+
| 8.30519999999997 |
+------------------+
1 row in set (0.00 sec)

## 使用函數的語法

```sql
SELECT FUNCTION(input, parameter) AS alias
```

In [7]:
SELECT 2.718 AS e,
       ROUND(2.718) AS round_e_0,    -- round to 0 digit
       ROUND(2.718, 1) AS round_e_1, -- round to 1 digit
       ROUND(2.718, 2) AS round_e_2; -- round to 2 digits

+-------+-----------+-----------+-----------+
| e     | round_e_0 | round_e_1 | round_e_2 |
+-------+-----------+-----------+-----------+
| 2.718 | 3.0       | 2.7       | 2.72      |
+-------+-----------+-----------+-----------+
1 row in set (0.00 sec)

## 有些函數不需要輸入、有些函數參數具有預設

```sql
SELECT DATE() AS todays_date,
       ROUND(2.718) AS round_e_0;
```

## 複合函數（Composite functions）

意即在函數中包括函數、先後使用多個函數，先使用的函數輸出將會成為後使用的函數輸入。

In [8]:
SELECT 'Boston' AS city,
       SUBSTR('Boston', 1, 3) AS substr_city,
       UPPER(SUBSTR('Boston', 1, 3)) AS upper_substr_city;

+--------+-------------+-------------------+
| city   | substr_city | upper_substr_city |
+--------+-------------+-------------------+
| Boston | Bos         | BOS               |
+--------+-------------+-------------------+
1 row in set (0.00 sec)

## 通用函數又細分為四種

1. 資料類別相關。
2. 計算數值。
3. 操作文字。
4. 操作日期時間。

### 通用函數：資料類別相關 `TYPEOF()`

使用 `TYPEOF()` 函數顯示常數或者資料表欄位的類別。

In [9]:
SELECT TYPEOF(release_year) AS typeof_release_year,
       TYPEOF(rating) AS typeof_rating,
       TYPEOF(title) AS typeof_title
  FROM movies
 LIMIT 1;

+---------------------+---------------+--------------+
| typeof_release_year | typeof_rating | typeof_title |
+---------------------+---------------+--------------+
| integer             | real          | text         |
+---------------------+---------------+--------------+
1 row in set (0.00 sec)

### 通用函數：資料類別相關 `IFNULL()`

使用 `IFNULL()` 函數回傳輸入常數或者資料表欄位中的第一個非空值資料，若皆為空值則回傳空值。

In [10]:
SELECT IFNULL(NULL, NULL) AS null_value,
       IFNULL(NULL, 'Null replaced by text') AS text_value;

+------------+-----------------------+
| null_value | text_value            |
+------------+-----------------------+
| NULL       | Null replaced by text |
+------------+-----------------------+
1 row in set (0.00 sec)

In [11]:
SELECT Province_State,
       IFNULL(Province_State, 'No province data') AS province_or_text_value,
       Admin2,
       IFNULL(Admin2, 'No county data') AS county_or_text_value
  FROM lookup_table
 LIMIT 5;

+----------------+------------------------+--------+----------------------+
| Province_State | province_or_text_value | Admin2 | county_or_text_value |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| American Samoa | American Samoa         | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
| NULL           | No province data       | NULL   | No county data       |
+----------------+------------------------+--------+----------------------+
5 rows in set (0.00 sec)

### 通用函數：操作文字 `TRIM()`/`LTRIM()`/`RTRIM()`

- 清除文字資料中的指定特徵。
- 沒有指定特徵則清除文字左側或右側的多餘空白。

```sql
TRIM(string, pattern)
```

In [12]:
SELECT TRIM('Tony Stark', ' Stark') AS tony,
       TRIM('Tony Stark', 'Tony ') AS stark,
       LENGTH('   Tony Stark   ') AS tony_stark,
       LENGTH(TRIM('   Tony Stark   ')) AS trim_tony_stark,
       LENGTH(LTRIM('   Tony Stark   ')) AS ltrim_tony_stark,
       LENGTH(RTRIM('   Tony Stark   ')) AS rtrim_tony_stark;

+------+-------+------------+-----------------+------------------+------------------+
| tony | stark | tony_stark | trim_tony_stark | ltrim_tony_stark | rtrim_tony_stark |
+------+-------+------------+-----------------+------------------+------------------+
| Tony | Stark | 16         | 10              | 13               | 13               |
+------+-------+------------+-----------------+------------------+------------------+
1 row in set (0.00 sec)

### 通用函數：操作文字 `REPLACE()`

取代文字資料中的指定特徵。

```sql
REPLACE(string, pattern, replacement)
```

In [13]:
SELECT 'Anakin Skywalker' AS anakin,
       REPLACE('Anakin Skywalker', 'Anakin', 'Luke') AS luke;

+------------------+----------------+
| anakin           | luke           |
+------------------+----------------+
| Anakin Skywalker | Luke Skywalker |
+------------------+----------------+
1 row in set (0.00 sec)

### 通用函數：操作文字 `INSTR()`

回傳文字資料中指定特徵的位置，若文字資料沒有指定特徵則回傳整數 `0`。

```sql
INSTR(string, pattern)
```

In [14]:
SELECT 'Tony Stark' AS tony_stark,
       INSTR('Tony Stark', 'Stark') AS positive_position,
       INSTR('Tony Stark', 'Steve') AS zero;

+------------+-------------------+------+
| tony_stark | positive_position | zero |
+------------+-------------------+------+
| Tony Stark | 6                 | 0    |
+------------+-------------------+------+
1 row in set (0.00 sec)

### 通用函數：操作日期時間

`DATE('now', 'localtime')`、`TIME('now', 'localtime')` 與 `DATETIME('now', 'localtime')` 函數可以顯示電腦時區現在的日期、時間與日期時間，並且以 ISO-8601 標準格式 `YYYY-MM-DD HH:MM:SS` 呈現

```sql
SELECT DATE('now', 'localtime') AS date_now,
       TIME('now', 'localtime') AS time_now,
       DATETIME('now', 'localtime') AS datetime_now;
```

## 也可以輸入 ISO-8601 標準格式作為日期、時間或日期時間

In [15]:
SELECT DATE('2022-12-31') AS date_20221231,
       TIME('23:59:59') AS time_235959,
       DATETIME('2022-12-31 23:59:59') AS datetime_20221231235959;

+---------------+-------------+-------------------------+
| date_20221231 | time_235959 | datetime_20221231235959 |
+---------------+-------------+-------------------------+
| 2022-12-31    | 23:59:59    | 2022-12-31 23:59:59     |
+---------------+-------------+-------------------------+
1 row in set (0.00 sec)

### 通用函數：操作日期時間 `STRFTIME()`

`STRFTIME()` 函數可以調整日期、時間或日期時間的顯示格式，常用的日期、時間格式參數有：

- `%d`：二位數的日（01-31）
- `%j`：一年中的第幾天（001-366）
- `%m`：二位數的月（01-12）
- `%w`：一星期中的第幾天（0-6）
- `%W`：一年中的第幾週（00-53）
- `%Y`：四位數的年（0000-9999）
- `%H`：兩位數的小時（00-24）
- `%M`：兩位數的分鐘（00-59）
- `%S`：兩位數的秒（00-59）

In [16]:
SELECT '2022-12-31 23:59:59' AS datetime_20221231235959,
       STRFTIME('%d', '2022-12-31 23:59:59') AS day_part,
       STRFTIME('%j', '2022-12-31 23:59:59') AS day_of_year,
       STRFTIME('%m', '2022-12-31 23:59:59') AS month_part,
       STRFTIME('%w', '2022-12-31 23:59:59') AS weekday,
       STRFTIME('%W', '2022-12-31 23:59:59') AS nth_week,
       STRFTIME('%Y', '2022-12-31 23:59:59') AS year_part,
       STRFTIME('%H:%M:%S', '2022-12-31 23:59:59') AS time_part;

+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
| datetime_20221231235959 | day_part | day_of_year | month_part | weekday | nth_week | year_part | time_part |
+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
| 2022-12-31 23:59:59     | 31       | 365         | 12         | 6       | 52       | 2022      | 23:59:59  |
+-------------------------+----------+-------------+------------+---------+----------+-----------+-----------+
1 row in set (0.00 sec)

## 使用聚合函數 `COUNT()` 時候注意兩種不同的用法

- 輸入 `*` 藉以獲得資料表列數。
- 輸入欄位的名稱獲得該欄位「非空值」列數。
- 兩種不同用法在沒有空值 `NULL` 的欄位上輸出是相同的。

In [17]:
SELECT COUNT(*) AS nrows_table,
       COUNT(Province_State) AS non_null_province,
       COUNT(Admin2) AS non_null_county,
       COUNT(Country_Region) AS non_null_country_region
  FROM lookup_table;

+-------------+-------------------+-----------------+-------------------------+
| nrows_table | non_null_province | non_null_county | non_null_country_region |
+-------------+-------------------+-----------------+-------------------------+
| 4175        | 3981              | 3342            | 4175                    |
+-------------+-------------------+-----------------+-------------------------+
1 row in set (0.03 sec)

## 如何快速釐清不同資料庫管理系統的函數文件

- 搜尋「{database name} function reference」，同樣從通用（四個小分類）與聚合兩個角度切入。
    - 以 SQLite 舉例。
    - 以 MySQL 舉例。
    - 以 Oracle Database 舉例。

## 排序查詢結果

## 除了欄位名稱，`ORDER BY` 亦可以指定 `SELECT` 之後的欄位順序

In [18]:
SELECT title,
       release_year,
       rating
  FROM movies
 ORDER BY 2 DESC,
          3
 LIMIT 11;

+------------------------------+--------------+--------+
| title                        | release_year | rating |
+------------------------------+--------------+--------+
| Zack Snyder's Justice League | 2021         | 8.3    |
+------------------------------+--------------+--------+
| Soul                         | 2020         | 8.1    |
+------------------------------+--------------+--------+
| Hamilton                     | 2020         | 8.5    |
+------------------------------+--------------+--------+
| Ford v Ferrari               | 2019         | 8.1    |
+------------------------------+--------------+--------+
| Portrait of a Lady on Fire   | 2019         | 8.1    |
+------------------------------+--------------+--------+
| Klaus                        | 2019         | 8.2    |
+------------------------------+--------------+--------+
| 7 Kogustaki Mucize           | 2019         | 8.2    |
+------------------------------+--------------+--------+
| 1917                         | 2019         | 8.3    |
+------------------------------+--------------+--------+
| Joker                        | 2019         | 8.4    |
+------------------------------+--------------+--------+
| Avengers: Endgame            | 2019         | 8.4    |
+------------------------------+--------------+--------+
| Parasite                     | 2019         | 8.6    |
+------------------------------+--------------+--------+
11 rows in set (0.00 sec)

## 排序有 `NULL` 的欄位

- 預設從 `NULL` 開始排序。
- 可以 `NULLS LAST` 指定讓 `NULL` 排序在末端（預設 `NULLS FIRST`）。

In [19]:
SELECT Country_Region,
       Province_State
  FROM lookup_table
 ORDER BY Province_State
 LIMIT 10;

+---------------------+----------------+
| Country_Region      | Province_State |
+---------------------+----------------+
| Afghanistan         | NULL           |
+---------------------+----------------+
| Albania             | NULL           |
+---------------------+----------------+
| Algeria             | NULL           |
+---------------------+----------------+
| Andorra             | NULL           |
+---------------------+----------------+
| Angola              | NULL           |
+---------------------+----------------+
| Antigua and Barbuda | NULL           |
+---------------------+----------------+
| Azerbaijan          | NULL           |
+---------------------+----------------+
| Argentina           | NULL           |
+---------------------+----------------+
| Australia           | NULL           |
+---------------------+----------------+
| Austria             | NULL           |
+---------------------+----------------+
10 rows in set (0.00 sec)

In [20]:
SELECT Country_Region,
       Province_State
  FROM lookup_table
 ORDER BY Province_State NULLS FIRST
 LIMIT 10;

+---------------------+----------------+
| Country_Region      | Province_State |
+---------------------+----------------+
| Afghanistan         | NULL           |
+---------------------+----------------+
| Albania             | NULL           |
+---------------------+----------------+
| Algeria             | NULL           |
+---------------------+----------------+
| Andorra             | NULL           |
+---------------------+----------------+
| Angola              | NULL           |
+---------------------+----------------+
| Antigua and Barbuda | NULL           |
+---------------------+----------------+
| Azerbaijan          | NULL           |
+---------------------+----------------+
| Argentina           | NULL           |
+---------------------+----------------+
| Australia           | NULL           |
+---------------------+----------------+
| Austria             | NULL           |
+---------------------+----------------+
10 rows in set (0.00 sec)

In [21]:
SELECT Country_Region,
       Province_State
  FROM lookup_table
 ORDER BY Province_State NULLS LAST
 LIMIT 10;

+----------------+-----------------+
| Country_Region | Province_State  |
+----------------+-----------------+
| Nigeria        | Abia            |
+----------------+-----------------+
| Italy          | Abruzzo         |
+----------------+-----------------+
| Brazil         | Acre            |
+----------------+-----------------+
| Nigeria        | Adamawa         |
+----------------+-----------------+
| Russia         | Adygea Republic |
+----------------+-----------------+
| Mexico         | Aguascalientes  |
+----------------+-----------------+
| Japan          | Aichi           |
+----------------+-----------------+
| Japan          | Akita           |
+----------------+-----------------+
| Nigeria        | Akwa Ibom       |
+----------------+-----------------+
| US             | Alabama         |
+----------------+-----------------+
10 rows in set (0.00 sec)

## `ORDER BY` 搭配 `LIMIT` 與 `OFFSET`

- `LIMIT m` 可以限制顯示列數 `m` 列。
- `OFFSET m` 可以指定要略過前面 `m` 列。

In [22]:
SELECT title,
       rating
  FROM movies
 ORDER BY rating DESC
 LIMIT 7; -- Top 7

+-----------------------------------------------+--------+
| title                                         | rating |
+-----------------------------------------------+--------+
| The Shawshank Redemption                      | 9.3    |
+-----------------------------------------------+--------+
| The Godfather                                 | 9.2    |
+-----------------------------------------------+--------+
| The Godfather: Part II                        | 9      |
+-----------------------------------------------+--------+
| The Dark Knight                               | 9      |
+-----------------------------------------------+--------+
| 12 Angry Men                                  | 9      |
+-----------------------------------------------+--------+
| Schindler's List                              | 8.9    |
+-----------------------------------------------+--------+
| The Lord of the Rings: The Return of the King | 8.9    |
+-----------------------------------------------+--------+
7 rows in set (0.00 sec)

In [23]:
SELECT title,
       rating
  FROM movies
 ORDER BY rating DESC
 LIMIT 5 
OFFSET 2; -- Top 3rd - 7th

+-----------------------------------------------+--------+
| title                                         | rating |
+-----------------------------------------------+--------+
| The Godfather: Part II                        | 9      |
+-----------------------------------------------+--------+
| The Dark Knight                               | 9      |
+-----------------------------------------------+--------+
| 12 Angry Men                                  | 9      |
+-----------------------------------------------+--------+
| Schindler's List                              | 8.9    |
+-----------------------------------------------+--------+
| The Lord of the Rings: The Return of the King | 8.9    |
+-----------------------------------------------+--------+
5 rows in set (0.00 sec)

In [24]:
SELECT title,
       rating
  FROM movies
 ORDER BY rating DESC
 LIMIT 1
OFFSET 3; -- The 4th best movie of all-time

+-----------------+--------+
| title           | rating |
+-----------------+--------+
| The Dark Knight | 9      |
+-----------------+--------+
1 row in set (0.00 sec)

## 篩選觀測值

## 文字特徵比對

除了使用 `=` 作為作為文字內容精準比對的關係運算符，我們也常需要使用具備特徵比對（Pattern matching）性質的關係運算符 `LIKE`，使用 `LIKE` 作為關係運算符的時候要搭配萬用字元（Wildcards）來描述特徵。

|萬用字元|作用描述|
|:------|:-----|
|`%`|表示任意文字，包含空字元|
|`_`|表示剛好一個文字|

舉例來說，`'The Lord of the Rings%'` 這個文字特徵表示開頭為 Lord of the Rings 後面接任意文字。

In [25]:
SELECT title
  FROM movies
 WHERE title LIKE 'The Lord of the Rings%'; -- The Lord of the Rings followed by any characters

+---------------------------------------------------+
| title                                             |
+---------------------------------------------------+
| The Lord of the Rings: The Return of the King     |
+---------------------------------------------------+
| The Lord of the Rings: The Fellowship of the Ring |
+---------------------------------------------------+
| The Lord of the Rings: The Two Towers             |
+---------------------------------------------------+
3 rows in set (0.00 sec)

In [26]:
SELECT title
  FROM movies
 WHERE title LIKE 'The ______'; -- The followed by a space and 6 characters

+------------+
| title      |
+------------+
| The Matrix |
+------------+
| The Bandit |
+------------+
2 rows in set (0.00 sec)

## 比對 `%` 與 `_` 文字特徵

使用 `ESCAPE` 保留字描述跳脫符號 `\`。

In [27]:
SELECT '87' AS text_without_percentage,
       '87' LIKE '__%' AS true,
       '87' LIKE '__\%' ESCAPE '\' AS false,
       '87%' AS text_with_pecentage,
       '87%' LIKE '__\%' ESCAPE '\' AS true;

+-------------------------+------+-------+---------------------+------+
| text_without_percentage | true | false | text_with_pecentage | true |
+-------------------------+------+-------+---------------------+------+
| 87                      | 1    | 0     | 87%                 | 1    |
+-------------------------+------+-------+---------------------+------+
1 row in set (0.00 sec)

In [28]:
SELECT '87' AS text_without_underscore,
       '87' LIKE '%_' AS true,
       '87' LIKE '%_\_' ESCAPE '\' AS false,
       '87_' AS text_with_underscore,
       '87_' LIKE '%_\_' ESCAPE '\' AS true;

+-------------------------+------+-------+----------------------+------+
| text_without_underscore | true | false | text_with_underscore | true |
+-------------------------+------+-------+----------------------+------+
| 87                      | 1    | 0     | 87_                  | 1    |
+-------------------------+------+-------+----------------------+------+
1 row in set (0.00 sec)

## 使用 `AND` 結合兩個條件

兩條件皆為真才會判斷為真，其餘狀況均為假。

In [29]:
SELECT 0 AND 0 AS False,
       0 AND 1 AS False,
       1 AND 0 AS False,
       1 AND 1 AS True;

+-------+-------+-------+------+
| False | False | False | True |
+-------+-------+-------+------+
| 0     | 0     | 0     | 1    |
+-------+-------+-------+------+
1 row in set (0.00 sec)

## 使用 `AND` 結合兩個條件（續）

最後從資料表中篩選的觀測值，會是 `condition_1_and_condition_2` 為 1（布林值 `True`）的觀測值。

In [30]:
SELECT release_year >= 1990 AS condition_1,
       release_year <= 2010 AS condition_2,
       release_year >= 1990 AND release_year <= 2010 AS condtion_1_and_condition_2
  FROM movies
 LIMIT 5;

+-------------+-------------+----------------------------+
| condition_1 | condition_2 | condtion_1_and_condition_2 |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
5 rows in set (0.00 sec)

## 以 `AND` 結合 `>=` 與 `<=` 兩個關係運算符之條件

可以改使用 `BETWEEN lower_bound AND upper_bound` 作為關係運算符。

In [31]:
SELECT release_year >= 1990 AS condition_1,
       release_year <= 2010 AS condition_2,
       release_year BETWEEN 1990 AND 2010 AS condtion_1_and_condition_2
  FROM movies
 LIMIT 5;

+-------------+-------------+----------------------------+
| condition_1 | condition_2 | condtion_1_and_condition_2 |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
| 1           | 1           | 1                          |
+-------------+-------------+----------------------------+
| 0           | 1           | 0                          |
+-------------+-------------+----------------------------+
5 rows in set (0.00 sec)

In [32]:
SELECT title,
       release_year
  FROM movies
 WHERE release_year BETWEEN 1990 AND 2010
 LIMIT 5;

+-----------------------------------------------+--------------+
| title                                         | release_year |
+-----------------------------------------------+--------------+
| The Shawshank Redemption                      | 1994         |
+-----------------------------------------------+--------------+
| The Dark Knight                               | 2008         |
+-----------------------------------------------+--------------+
| Schindler's List                              | 1993         |
+-----------------------------------------------+--------------+
| The Lord of the Rings: The Return of the King | 2003         |
+-----------------------------------------------+--------------+
| Pulp Fiction                                  | 1994         |
+-----------------------------------------------+--------------+
5 rows in set (0.00 sec)

## 使用 `OR` 結合兩個條件

兩者皆為假才為假，其餘狀況均為真。

In [33]:
SELECT 0 OR 0 AS False,
       0 OR 1 AS True,
       1 OR 0 AS True,
       1 OR 1 AS True;

+-------+------+------+------+
| False | True | True | True |
+-------+------+------+------+
| 0     | 1    | 1    | 1    |
+-------+------+------+------+
1 row in set (0.00 sec)

## 使用 `OR` 結合兩個條件（續）

最後從資料表中篩選的觀測值，會是 `condition_1_or_condition_2` 為 1（布林值 `True`）的觀測值。

In [34]:
SELECT director = 'Steven Spielberg' AS condition_1,
       director = 'Christopher Nolan' AS condition_2,
       director = 'Steven Spielberg' OR director = 'Christopher Nolan' AS condtion_1_or_condition_2
  FROM movies
 LIMIT 10;

+-------------+-------------+---------------------------+
| condition_1 | condition_2 | condtion_1_or_condition_2 |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 1           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 1           | 0           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
10 rows in set (0.00 sec)

## 以 `IN` 作為關係運算符，並以小括號 `()` 表示欲判斷是否存在於目標集合

In [35]:
SELECT director = 'Steven Spielberg' AS condition_1,
       director = 'Christopher Nolan' AS condition_2,
       director IN ('Steven Spielberg', 'Christopher Nolan') AS condtion_1_or_condition_2
  FROM movies
 LIMIT 10;

+-------------+-------------+---------------------------+
| condition_1 | condition_2 | condtion_1_or_condition_2 |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 1           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 1           | 0           | 1                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
| 0           | 0           | 0                         |
+-------------+-------------+---------------------------+
10 rows in set (0.00 sec)

In [36]:
SELECT title,
       director
  FROM movies
 WHERE director IN ('Steven Spielberg', 'Christopher Nolan')
 LIMIT 5;

+---------------------+-------------------+
| title               | director          |
+---------------------+-------------------+
| The Dark Knight     | Christopher Nolan |
+---------------------+-------------------+
| Schindler's List    | Steven Spielberg  |
+---------------------+-------------------+
| Inception           | Christopher Nolan |
+---------------------+-------------------+
| Saving Private Ryan | Steven Spielberg  |
+---------------------+-------------------+
| Interstellar        | Christopher Nolan |
+---------------------+-------------------+
5 rows in set (0.00 sec)

## `NOT` 可以將條件的判斷結果反轉，亦即真假互換

In [37]:
SELECT NOT 1 AS False,
       NOT 0 AS True;

+-------+------+
| False | True |
+-------+------+
| 0     | 1    |
+-------+------+
1 row in set (0.00 sec)

## `NOT` 可以擺放在條件的前面，也可以放置在關係運算符之前

通常我們偏好唸起來與英文更相似的敘述。

In [38]:
SELECT title,
       director
  FROM movies
 WHERE director NOT IN ('Steven Spielberg', 'Christopher Nolan') -- preferred
 LIMIT 5;

+-----------------------------------------------+----------------------+
| title                                         | director             |
+-----------------------------------------------+----------------------+
| The Shawshank Redemption                      | Frank Darabont       |
+-----------------------------------------------+----------------------+
| The Godfather                                 | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| The Godfather: Part II                        | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| 12 Angry Men                                  | Sidney Lumet         |
+-----------------------------------------------+----------------------+
| The Lord of the Rings: The Return of the King | Peter Jackson        |
+-----------------------------------------------+----------------------+
5 rows in set (0.00 sec)

In [39]:
SELECT title,
       director
  FROM movies
 WHERE NOT director IN ('Steven Spielberg', 'Christopher Nolan')
 LIMIT 5;

+-----------------------------------------------+----------------------+
| title                                         | director             |
+-----------------------------------------------+----------------------+
| The Shawshank Redemption                      | Frank Darabont       |
+-----------------------------------------------+----------------------+
| The Godfather                                 | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| The Godfather: Part II                        | Francis Ford Coppola |
+-----------------------------------------------+----------------------+
| 12 Angry Men                                  | Sidney Lumet         |
+-----------------------------------------------+----------------------+
| The Lord of the Rings: The Return of the King | Peter Jackson        |
+-----------------------------------------------+----------------------+
5 rows in set (0.00 sec)

## 空值的關係運算符

`NULL` 空值不適用 `=` 或者 `!=` 關係運算符，必須以 `IS` 作為關係運算符才能夠判斷是否為空值，若逕自使用 `=` 或者 `!=` 則判斷結果依然為 `NULL` 空值，無法得到 0（布林值 `False`）或 1（布林值 `True`）的判斷結果。

In [40]:
SELECT NULL = NULL AS null_value,
       NULL != NULL AS null_value,
       NULL IS NULL AS True,
       NULL IS NOT NULL AS False;

+------------+------------+------+-------+
| null_value | null_value | True | False |
+------------+------------+------+-------+
| NULL       | NULL       | 1    | 0     |
+------------+------------+------+-------+
1 row in set (0.00 sec)

## 在 `covid19` 資料庫的 `lookup_table` 資料表中 `Province_State` 與 `Admin2` 欄都有不少空值的存在

In [41]:
SELECT Province_State,
       Admin2,
       Province_State = NULL AS Province_State_equals_to_null,
       Admin2 != NULL AS Admin2_not_equals_to_null
  FROM lookup_table
 LIMIT 5;

+----------------+--------+-------------------------------+---------------------------+
| Province_State | Admin2 | Province_State_equals_to_null | Admin2_not_equals_to_null |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| American Samoa | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
| NULL           | NULL   | NULL                          | NULL                      |
+----------------+--------+-------------------------------+---------------------------+
5 rows in set (0.00 sec)

## 必須以 `IS` 作為關係運算符才能夠判斷是否為空值

In [42]:
SELECT Province_State,
       Admin2,
       Province_State IS NULL AS Province_State_is_null,
       Admin2 IS NOT NULL AS Admin2_is_not_null
  FROM lookup_table
 LIMIT 5;

+----------------+--------+------------------------+--------------------+
| Province_State | Admin2 | Province_State_is_null | Admin2_is_not_null |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
| American Samoa | NULL   | 0                      | 0                  |
+----------------+--------+------------------------+--------------------+
| NULL           | NULL   | 1                      | 0                  |
+----------------+--------+------------------------+--------------------+
5 rows in set (0.00 sec)

In [43]:
SELECT Province_State,
       Admin2
  FROM lookup_table
 WHERE Province_State IS NOT NULL AND
       Admin2 IS NOT NULL
 LIMIT 5;

+--------------------------------+--------------+
| Province_State                 | Admin2       |
+--------------------------------+--------------+
| Sint Eustatius and Saba        | Bonaire      |
+--------------------------------+--------------+
| Ascension and Tristan da Cunha | Saint Helena |
+--------------------------------+--------------+
| Puerto Rico                    | Adjuntas     |
+--------------------------------+--------------+
| Puerto Rico                    | Aguada       |
+--------------------------------+--------------+
| Puerto Rico                    | Aguadilla    |
+--------------------------------+--------------+
5 rows in set (0.00 sec)

## 篩選日期時間的欄位

- 善用關係運算符。
- 日期時間的常數要加上單引號。
- 善用操作日期時間的函數。

In [44]:
SELECT DISTINCT Last_Update
  FROM daily_report
 WHERE DATE(Last_Update) != '2021-04-01';

+---------------------+
| Last_Update         |
+---------------------+
| 2020-12-21 13:27:30 |
+---------------------+
| 2021-01-08 23:22:27 |
+---------------------+
| 2021-02-14 23:24:19 |
+---------------------+
| 2020-08-04 02:27:56 |
+---------------------+
| 2020-08-07 22:34:20 |
+---------------------+
| 2021-01-24 23:22:19 |
+---------------------+
| 2021-03-14 23:25:24 |
+---------------------+
7 rows in set (0.01 sec)

In [45]:
SELECT DISTINCT Date
  FROM time_series
 WHERE Date BETWEEN '2020-01-22' AND '2020-01-31';

+------------+
| Date       |
+------------+
| 2020-01-22 |
+------------+
| 2020-01-23 |
+------------+
| 2020-01-24 |
+------------+
| 2020-01-25 |
+------------+
| 2020-01-26 |
+------------+
| 2020-01-27 |
+------------+
| 2020-01-28 |
+------------+
| 2020-01-29 |
+------------+
| 2020-01-30 |
+------------+
| 2020-01-31 |
+------------+
10 rows in set (0.08 sec)

In [46]:
SELECT DISTINCT STRFTIME('%Y-%m', Date) AS year_month
  FROM time_series
 WHERE STRFTIME('%Y', Date) == '2021';

+------------+
| year_month |
+------------+
| 2021-01    |
+------------+
| 2021-02    |
+------------+
| 2021-03    |
+------------+
3 rows in set (0.07 sec)

In [47]:
SELECT MIN(Date) AS min_date,
       MAX(Date) AS max_date
  FROM time_series
 WHERE Date < '2021-01-01';

+------------+------------+
| min_date   | max_date   |
+------------+------------+
| 2020-01-22 | 2020-12-31 |
+------------+------------+
1 row in set (0.02 sec)

## 條件邏輯

## 條件邏輯是第三種生成衍生計算欄位的方式

透過條件所得的布林值來決定所指定的資料值為何，在實務中這樣的技巧又被稱為分箱（Binning）、編碼（Encoding）或者分組（Categorizing）。

## 使用 `CASE WHEN` 敘述衍生計算欄位

```sql
SELECT CASE WHEN condition_1 THEN result_1
            WHEN condition_2 THEN result_2 END AS alias;
```

In [48]:
SELECT title,
       release_year,
       CASE WHEN release_year >= 2000 THEN 'After millennium'
            WHEN release_year < 2000 THEN 'Before millennium' END AS before_or_after_millennium
  FROM movies
 LIMIT 10;

+---------------------------------------------------+--------------+----------------------------+
| title                                             | release_year | before_or_after_millennium |
+---------------------------------------------------+--------------+----------------------------+
| The Shawshank Redemption                          | 1994         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Godfather                                     | 1972         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Godfather: Part II                            | 1974         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Dark Knight                                   | 2008         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
| 12 Angry Men                                      | 1957         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| Schindler's List                                  | 1993         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Lord of the Rings: The Return of the King     | 2003         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
| Pulp Fiction                                      | 1994         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Good, the Bad and the Ugly                    | 1966         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Lord of the Rings: The Fellowship of the Ring | 2001         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
10 rows in set (0.00 sec)

## 分組需求與布林值一樣是二元、非黑即白的時候

`CASE WHEN` 敘述可以加入 `ELSE` 取代其中一個條件的敘述。

```sql
SELECT CASE WHEN condition_1 THEN result_1
            ELSE result_2 END AS alias;
```

In [49]:
SELECT title,
       release_year,
       CASE WHEN release_year >= 2000 THEN 'After millennium'
            ELSE 'Before millennium' END AS before_or_after_millennium
  FROM movies
 LIMIT 10;

+---------------------------------------------------+--------------+----------------------------+
| title                                             | release_year | before_or_after_millennium |
+---------------------------------------------------+--------------+----------------------------+
| The Shawshank Redemption                          | 1994         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Godfather                                     | 1972         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Godfather: Part II                            | 1974         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Dark Knight                                   | 2008         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
| 12 Angry Men                                      | 1957         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| Schindler's List                                  | 1993         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Lord of the Rings: The Return of the King     | 2003         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
| Pulp Fiction                                      | 1994         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Good, the Bad and the Ugly                    | 1966         | Before millennium          |
+---------------------------------------------------+--------------+----------------------------+
| The Lord of the Rings: The Fellowship of the Ring | 2001         | After millennium           |
+---------------------------------------------------+--------------+----------------------------+
10 rows in set (0.00 sec)

## 分組需求超過兩組的時候，只要增加 `WHEN` 敘述與條件即可

```sql
SELECT CASE WHEN condition_1 THEN result_1
            WHEN condition_2 THEN result_2
            ...
            ELSE result_n END AS alias;
```

In [50]:
SELECT title,
       runtime,
       CASE WHEN runtime > 180 THEN 'Over 3 hours'
            WHEN runtime > 120 THEN 'Over 2 hours'
            WHEN runtime > 60 THEN 'Over 1 hour'
            WHEN runtime <= 60 THEN 'Below 1 hour' END AS runtime_category
  FROM movies
 LIMIT 10;

+---------------------------------------------------+---------+------------------+
| title                                             | runtime | runtime_category |
+---------------------------------------------------+---------+------------------+
| The Shawshank Redemption                          | 142     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Godfather                                     | 175     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Godfather: Part II                            | 202     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| The Dark Knight                                   | 152     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| 12 Angry Men                                      | 96      | Over 1 hour      |
+---------------------------------------------------+---------+------------------+
| Schindler's List                                  | 195     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| The Lord of the Rings: The Return of the King     | 201     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| Pulp Fiction                                      | 154     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Good, the Bad and the Ugly                    | 178     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Lord of the Rings: The Fellowship of the Ring | 178     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
10 rows in set (0.00 sec)

## 加入 `ELSE` 取代其中一個條件 `runtime <= 60`

In [51]:
SELECT title,
       runtime,
       CASE WHEN runtime > 180 THEN 'Over 3 hours'
            WHEN runtime > 120 THEN 'Over 2 hours'
            WHEN runtime > 60 THEN 'Over 1 hour'
            ELSE 'Below 1 hour' END AS runtime_category
  FROM movies
 LIMIT 10;

+---------------------------------------------------+---------+------------------+
| title                                             | runtime | runtime_category |
+---------------------------------------------------+---------+------------------+
| The Shawshank Redemption                          | 142     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Godfather                                     | 175     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Godfather: Part II                            | 202     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| The Dark Knight                                   | 152     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| 12 Angry Men                                      | 96      | Over 1 hour      |
+---------------------------------------------------+---------+------------------+
| Schindler's List                                  | 195     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| The Lord of the Rings: The Return of the King     | 201     | Over 3 hours     |
+---------------------------------------------------+---------+------------------+
| Pulp Fiction                                      | 154     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Good, the Bad and the Ugly                    | 178     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
| The Lord of the Rings: The Fellowship of the Ring | 178     | Over 2 hours     |
+---------------------------------------------------+---------+------------------+
10 rows in set (0.00 sec)

## 條件是否互斥與寫作順序

- 條件是否互斥（Mutually exclusive）？
- 若沒有互斥，那麼寫作的順序就會是賦值的順序。

In [52]:
SELECT DISTINCT CASE WHEN runtime > 60 THEN 'Over 1 hours' -- unexpected result
                WHEN runtime > 120 THEN 'Over 2 hours'
                WHEN runtime > 180 THEN 'Over 3 hour'
                WHEN runtime <= 60 THEN 'Below 1 hour' END AS runtime_category
  FROM movies;

+------------------+
| runtime_category |
+------------------+
| Over 1 hours     |
+------------------+
| Below 1 hour     |
+------------------+
2 rows in set (0.00 sec)

## 如果不想要特別注意寫作順序，可以把條件設計為互斥

In [53]:
SELECT DISTINCT CASE WHEN runtime > 60 AND runtime <= 120 THEN 'Over 1 hours' -- expected result
                WHEN runtime > 120 AND runtime <= 180 THEN 'Over 2 hours'
                WHEN runtime > 180 THEN 'Over 3 hour'
                WHEN runtime <= 60 THEN 'Below 1 hour' END AS runtime_category
  FROM movies;

+------------------+
| runtime_category |
+------------------+
| Over 2 hours     |
+------------------+
| Over 3 hour      |
+------------------+
| Over 1 hours     |
+------------------+
| Below 1 hour     |
+------------------+
4 rows in set (0.00 sec)

## 以 `CASE WHEN` 衍生計算欄位排序

`CASE WHEN` 除了能夠在 `SELECT` 敘述後使用，亦能夠在 `ORDER BY` 敘述後使用。想要以 `CASE WHEN` 衍生計算欄位排序，一種方式是在 `SELECT` 後建立別名並在 `ORDER BY` 後加上別名。

```sql
SELECT CASE WHEN condition_1 THEN result_1
            WHEN condition_2 THEN result_2
            ...
            ELSE result_n END AS alias
  FROM TABLE
 ORDER BY alias;
```

In [54]:
SELECT title,
       runtime,
       CASE WHEN runtime > 180 THEN 'Over 3 hours'
            WHEN runtime > 120 THEN 'Over 2 hours'
            WHEN runtime > 60 THEN 'Over 1 hour'
            ELSE 'Below 1 hour' END AS runtime_category
  FROM movies
 ORDER BY runtime_category
 LIMIT 10;

+--------------------------+---------+------------------+
| title                    | runtime | runtime_category |
+--------------------------+---------+------------------+
| Sherlock Jr.             | 45      | Below 1 hour     |
+--------------------------+---------+------------------+
| 12 Angry Men             | 96      | Over 1 hour      |
+--------------------------+---------+------------------+
| Life Is Beautiful        | 116     | Over 1 hour      |
+--------------------------+---------+------------------+
| The Silence of the Lambs | 118     | Over 1 hour      |
+--------------------------+---------+------------------+
| Léon: The Professional  | 110     | Over 1 hour      |
+--------------------------+---------+------------------+
| The Usual Suspects       | 106     | Over 1 hour      |
+--------------------------+---------+------------------+
| The Lion King            | 88      | Over 1 hour      |
+--------------------------+---------+------------------+
| Back to the Future       | 116     | Over 1 hour      |
+--------------------------+---------+------------------+
| American History X       | 119     | Over 1 hour      |
+--------------------------+---------+------------------+
| Modern Times             | 87      | Over 1 hour      |
+--------------------------+---------+------------------+
10 rows in set (0.00 sec)

## 略過 `SELECT` 後建立別名，直接在 `ORDER BY` 後加上 `CASE WHEN` 敘述

要注意這時就得將原本敘述最後的 `AS alias` 省去。

```sql
SELECT columns
  FROM TABLE
 ORDER BY CASE WHEN condition_1 THEN result_1
               WHEN condition_2 THEN result_2
               ...
               ELSE result_n END;
```

In [55]:
SELECT title,
       runtime
  FROM movies
 ORDER BY CASE WHEN runtime > 180 THEN 'Over 3 hours'
               WHEN runtime > 120 THEN 'Over 2 hours'
               WHEN runtime > 60 THEN 'Over 1 hour'
               ELSE 'Below 1 hour' END
 LIMIT 10;

+--------------------------+---------+
| title                    | runtime |
+--------------------------+---------+
| Sherlock Jr.             | 45      |
+--------------------------+---------+
| 12 Angry Men             | 96      |
+--------------------------+---------+
| Life Is Beautiful        | 116     |
+--------------------------+---------+
| The Silence of the Lambs | 118     |
+--------------------------+---------+
| Léon: The Professional  | 110     |
+--------------------------+---------+
| The Usual Suspects       | 106     |
+--------------------------+---------+
| The Lion King            | 88      |
+--------------------------+---------+
| Back to the Future       | 116     |
+--------------------------+---------+
| American History X       | 119     |
+--------------------------+---------+
| Modern Times             | 87      |
+--------------------------+---------+
10 rows in set (0.00 sec)

## 以 `CASE WHEN` 衍生計算欄位篩選

`CASE WHEN` 除了能夠搭配 `SELECT` 敘述、`ORDER BY` 敘述後使用，亦能夠搭配 `WHERE` 敘述使用。想要以 `CASE WHEN` 衍生計算欄位篩選資料表觀測值，在 `SELECT` 後建立別名並在 `WHERE` 後利用別名搭配關係運算符建立條件。

```sql
SELECT CASE WHEN condition_1 THEN result_1
            WHEN condition_2 THEN result_2
            ...
            ELSE result_n END AS alias
  FROM TABLE
 WHERE conditions;
```

In [56]:
SELECT title,
       runtime,
       CASE WHEN runtime > 180 THEN 'Over 3 hours'
            WHEN runtime > 120 THEN 'Over 2 hours'
            WHEN runtime > 60 THEN 'Over 1 hour'
            ELSE 'Below 1 hour' END AS runtime_category
  FROM movies
 WHERE runtime_category = 'Over 3 hours'
 ORDER BY runtime_category, 
          runtime DESC;

+-----------------------------------------------+---------+------------------+
| title                                         | runtime | runtime_category |
+-----------------------------------------------+---------+------------------+
| Gangs of Wasseypur                            | 321     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Zack Snyder's Justice League                  | 242     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Gone with the Wind                            | 238     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Once Upon a Time in America                   | 229     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Lawrence of Arabia                            | 228     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Ben-Hur                                       | 212     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Seven Samurai                                 | 207     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Andrei Rublev                                 | 205     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| The Godfather: Part II                        | 202     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| The Lord of the Rings: The Return of the King | 201     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Schindler's List                              | 195     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| The Green Mile                                | 189     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Swades                                        | 189     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Barry Lyndon                                  | 185     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| The Deer Hunter                               | 183     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
| Avengers: Endgame                             | 181     | Over 3 hours     |
+-----------------------------------------------+---------+------------------+
16 rows in set (0.00 sec)

## 分組與聚合結果篩選

## 以 `GROUP BY` 分組

對資料表中的欄位剔除重複值並且遞增排序，這樣的技巧在 SQL 與關聯式資料庫管理系統被稱為「分組」，在 SQL 敘述中加入 `GROUP BY` 就等同於 `DISTINCT` 與 `ORDER BY` 兩者同時作用的效果。

```sql
SELECT columns
  FROM table
 GROUP BY columns;
```

In [57]:
SELECT director
  FROM movies
 GROUP BY director
 LIMIT 10;

+-------------------------+
| director                |
+-------------------------+
| Aamir Khan              |
+-------------------------+
| Adam Elliot             |
+-------------------------+
| Akira Kurosawa          |
+-------------------------+
| Alejandro G. Iñárritu |
+-------------------------+
| Alfred Hitchcock        |
+-------------------------+
| Andrei Tarkovsky        |
+-------------------------+
| Andrew Stanton          |
+-------------------------+
| Anthony Russo           |
+-------------------------+
| Anurag Kashyap          |
+-------------------------+
| Asghar Farhadi          |
+-------------------------+
10 rows in set (0.00 sec)

## 笛卡兒積（Cartesian product）

不同欄位的獨一值會組成所有可能的集合。

In [58]:
SELECT director,
       release_year
  FROM movies
 GROUP BY director,
          release_year
 LIMIT 10;

+-------------------------+--------------+
| director                | release_year |
+-------------------------+--------------+
| Aamir Khan              | 2007         |
+-------------------------+--------------+
| Adam Elliot             | 2009         |
+-------------------------+--------------+
| Akira Kurosawa          | 1950         |
+-------------------------+--------------+
| Akira Kurosawa          | 1952         |
+-------------------------+--------------+
| Akira Kurosawa          | 1954         |
+-------------------------+--------------+
| Akira Kurosawa          | 1961         |
+-------------------------+--------------+
| Akira Kurosawa          | 1963         |
+-------------------------+--------------+
| Akira Kurosawa          | 1985         |
+-------------------------+--------------+
| Alejandro G. Iñárritu | 2000         |
+-------------------------+--------------+
| Alfred Hitchcock        | 1940         |
+-------------------------+--------------+
10 rows in set (0.00 sec)

## 結合聚合函數與 `GROUP BY` 完成分組聚合

同時使用聚合函數（例如 `AVG()`、`COUNT()`、`SUM()`...等）以及 `GROUP BY` 可以便捷地達成分組聚合。

```sql
SELECT AGGREGATE_FUNCTION(column) AS alias
  FROM table
 GROUP BY columns;
```

In [59]:
SELECT release_year,
       AVG(rating) AS avg_rating
  FROM movies
 GROUP BY release_year
 LIMIT 10;

+--------------+------------+
| release_year | avg_rating |
+--------------+------------+
| 1921         | 8.3        |
+--------------+------------+
| 1924         | 8.2        |
+--------------+------------+
| 1925         | 8.2        |
+--------------+------------+
| 1926         | 8.1        |
+--------------+------------+
| 1927         | 8.3        |
+--------------+------------+
| 1928         | 8.1        |
+--------------+------------+
| 1931         | 8.4        |
+--------------+------------+
| 1934         | 8.1        |
+--------------+------------+
| 1936         | 8.5        |
+--------------+------------+
| 1939         | 8.1        |
+--------------+------------+
10 rows in set (0.00 sec)

## 日期時間與 `GROUP BY`

In [60]:
SELECT STRFTIME('%Y-%m', Date) AS year_month,
       SUM(Daily_Cases) AS total_confirmed
  FROM time_series
 GROUP BY year_month;

+------------+-----------------+
| year_month | total_confirmed |
+------------+-----------------+
| 2020-01    | 9927            |
+------------+-----------------+
| 2020-02    | 76086           |
+------------+-----------------+
| 2020-03    | 789781          |
+------------+-----------------+
| 2020-04    | 2404056         |
+------------+-----------------+
| 2020-05    | 2908334         |
+------------+-----------------+
| 2020-06    | 4269745         |
+------------+-----------------+
| 2020-07    | 7146838         |
+------------+-----------------+
| 2020-08    | 7904323         |
+------------+-----------------+
| 2020-09    | 8502588         |
+------------+-----------------+
| 2020-10    | 12130122        |
+------------+-----------------+
| 2020-11    | 17268367        |
+------------+-----------------+
| 2020-12    | 20148851        |
+------------+-----------------+
| 2021-01    | 19467621        |
+------------+-----------------+
| 2021-02    | 11151041        |
+------------+-----------------+
| 2021-03    | 14645055        |
+------------+-----------------+
15 rows in set (0.10 sec)

## 以 `HAVING` 篩選分組聚合結果

假如我們希望針對分組聚合的結果進行篩選呢？

```sql
SELECT release_year,
       AVG(rating) AS avg_rating
  FROM movies
 WHERE AVG(rating) >= 8.5
 GROUP BY release_year;
```

```
Error: sqlite3_statement_backend::prepare: misuse of aggregate: AVG()
```

## 錯誤訊息：`misuse of aggregate: AVG()`

`HAVING` 就像是分組聚合版本的 `WHERE`，兩者作用的維度不同，`WHERE` 篩選原始資料表列中的「觀測值」、`HAVING` 篩選聚合結果中的「欄位」。

```sql
SELECT AGGREGATE_FUNCTION(column) AS alias
  FROM table
 GROUP BY columns
HAVING conditions;
```

In [61]:
SELECT release_year,
       AVG(rating) AS avg_rating
  FROM movies
 GROUP BY release_year
HAVING AVG(rating) >= 8.5;

+--------------+------------+
| release_year | avg_rating |
+--------------+------------+
| 1936         | 8.5        |
+--------------+------------+
| 1946         | 8.6        |
+--------------+------------+
| 1972         | 9.2        |
+--------------+------------+
| 1974         | 8.55       |
+--------------+------------+
| 1977         | 8.6        |
+--------------+------------+
| 1990         | 8.7        |
+--------------+------------+
| 1991         | 8.55       |
+--------------+------------+
| 1994         | 8.8        |
+--------------+------------+
| 1999         | 8.5        |
+--------------+------------+
| 2008         | 8.5        |
+--------------+------------+
10 rows in set (0.00 sec)

## 應用 `GROUP BY`、`HAVING` 與 `COUNT()` 尋找重複資料

重複的電影名稱（極少數的特例）為何？

In [62]:
SELECT COUNT(title) AS n_movies
  FROM movies;

+----------+
| n_movies |
+----------+
| 250      |
+----------+
1 row in set (0.00 sec)

In [63]:
SELECT COUNT(DISTINCT title) AS n_movies
  FROM movies;

+----------+
| n_movies |
+----------+
| 249      |
+----------+
1 row in set (0.00 sec)

In [64]:
SELECT title,
       COUNT(*) AS n_movies
  FROM movies
 GROUP BY title
 LIMIT 5;

+-----------------------+----------+
| title                 | n_movies |
+-----------------------+----------+
| 12 Angry Men          | 1        |
+-----------------------+----------+
| 12 Years a Slave      | 1        |
+-----------------------+----------+
| 1917                  | 1        |
+-----------------------+----------+
| 2001: A Space Odyssey | 1        |
+-----------------------+----------+
| 3 Idiots              | 1        |
+-----------------------+----------+
5 rows in set (0.00 sec)

In [65]:
SELECT title,
       COUNT(*) AS n_movies
  FROM movies
 GROUP BY title
HAVING n_movies != 1;

+----------+----------+
| title    | n_movies |
+----------+----------+
| Drishyam | 2        |
+----------+----------+
1 row in set (0.00 sec)

## 寫作順序必須遵從標準 SQL 的規定

```sql
SELECT DISTINCT columns AS alias,
       CASE WHEN condition_1 THEN result_1
            WHEN condition_2 THEN result_2
            ...
            ELSE result_n END AS alias
  FROM table
 WHERE conditions
 GROUP BY columns
HAVING conditions
 ORDER BY columns DESC
 LIMIT m
OFFSET m;
```

## 第二天的額外練習題

- 使用 `kaggleSurvey2022.db` 與 `twElection2022.db`
- [練習題連結](https://gke.mybinder.org/v2/gh/datainpoint/environment-hahow-sqlfifty/main?urlpath=git-pull%3Frepo%3Dhttps%253A%252F%252Fgithub.com%252Fdatainpoint%252Fclassroom-hahow-sqlfifty%26urlpath%3Dtree%252Fclassroom-hahow-sqlfifty%252Fworkshop%252Fexercises_day_two.ipynb%26branch%3Dmain)

## 學長姐常見問題彙整

> 老師您好，我在做作業16遇到一個問題，當我使用CAST做排序時，使用 CAST(assists AS REAL)/turnovers 及 CAST assists/CAST(turnovers AS REAL)的結排序果一樣，但是若是使用CAST(assists/turnovers AS REAL)的結果卻和上面兩者不同，請問是因為使用 CAST(assists/turnovers AS REAL)這個計算的時候，因為assists/turnovers 先進行計算且只留整數部分，所以即便後面轉成浮點數，小數點後也都是 .00000000 這樣的形式，變成有重複值的出現，最後才造成排序結果不同嗎?謝謝

## 學長姐常見問題彙整

> 老師您好，我想請問 COALESCE 函數的使用方法。
查了一下官方文件上的說明後， COALESCE 函數本來是會查詢出第一個非NULL值，如果全部都是NULL的話則顯示NULL。
```
coalesce(X,Y,...)
The coalesce() function returns a copy of its first non-NULL argument, or NULL if all arguments are NULL. Coalesce() must have at least 2 arguments.
```
>進一步查詢後發現如果要替換NULL值好像通常會提到以 ISNULL 函數操作，相較之下 COALESCE 函數的運用多半在合併資料遞補取代NULL的時候。
但實際在DBeaver上以老師的方法寫寫看，的確可以成功把NULL值替換。想請教實際使用時通常會怎麼使用 COALESCE 呢？如果以替換NULL值來說，可以用什麼角度解讀官方提供的用法呢（這樣之後其他函數才可以也觸類旁通）?
謝謝老師～

## 學長姐常見問題彙整（續）

> 老師好: 我有點困惑，為什麼在Jupyter 中跟SQLiteStudio 上面執行的編號都差1號呢，謝謝。

## 學長姐常見問題彙整（續）

> 老師好，我想要將每一欄都用CAST 轉成REAL，但是為什麼前三欄都無法像第四欄一樣順利轉換?謝謝老師~
```sql
SELECT CAST(assists AS REAL),
       CAST(turnovers AS REAL),
       CAST(assists/turnovers AS REAL) AS assist_turnover_ratio,
       CAST(assists AS REAL) / turnovers AS assist_turnover_ratio2
  FROM career_summaries;
```

## 學長姐常見問題彙整（續）

> 請問為什麼作業16 是ORDER BY assitsts/ CAST(turnovers AS real) DESC 而不是ORDER BY CAST(assists/turnovers AS real) DESC

## 學長姐常見問題彙整（續）

> 1. 請問以下OR的錯誤寫法，為何沒有報錯，但只跑出 name = 'Tom Hanks' 的一筆結果呢？ 
```sql
SELECT id,               
       name
  FROM actors
 WHERE name = 'Tom Hanks' OR 'Christian Bale' OR 'Leonardo DiCaprio';
```
> 2. 另外請教老師，若是要使用篩選條件：A欄觀測值=B欄觀測值=C欄觀測值是否可以寫作 WHERE A = B = C 或是寫作WHERE A=B AND B=C 或是有其他正確寫法？

## 學長姐常見問題彙整（續）

> 老師  請問第25、26、28、29題中 您在計算數值時，使用count(\*) 而不用count(column_names),我自己練習操作時，我使用count(column_names) 計算，出來的結果與您的解答相同，還特地回去看了聚合函數的影片，還是不了解為什麼老師解題會使用count(\*) 謝謝

## 學長姐常見問題彙整（續）

> 問題1.having 分組聚合後，才對結果做篩選，程式碼如下，為何資料會差1筆？請問以下寫法，意義有甚麼不同
```sql
having avg(heightMeters)>=2
having (heightMeters)>=2
```
> 問題2.使用goup by聚合後，heightMeters預設是以甚麼方式聚合？
```sql
select pos,heightMeters
from players
group by pos
```

## 學長姐常見問題彙整（續）

> 想請問最後使用HAVING設定條件產出時，為什麼這邊不能使用avg_height_meters 而必須使用 AVG(heightMeters)呢?
我的理解是在一開始SELECT時，已對欄位給予新的指定欄位別名，所以在最後設定條件時，需以新的欄位別名來做HAVING挑選。
發文完後發現我一直有誤解，剛Google了解後，書寫順序不代表執行順序阿~~~
以下為Google內容：
SQL 語句的書寫順序如下：
SELECT -> FROM -> WHERE -> GROUP BY -> HAVING -> ORDER BY
SQL 語句的執行順序如下：
FROM -> WHERE -> GROUP BY -> HAVING -> SELECT -> ORDER BY